 # Reading CSV and TXT Files

In [2]:
import pandas as pd

## Reading Data with Python

In [4]:
with open('D:\Downloads/btc-market-price.csv', 'r') as fp:
    print(fp)

<_io.TextIOWrapper name='D:\\Downloads/btc-market-price.csv' mode='r' encoding='cp1252'>

In [5]:
with open('D:\Downloads/btc-market-price.csv', 'r') as fp:
    for index, line in enumerate(fp.readlines()):
        # read just the first 10 lines
        if(index < 10):
            print(index, line)

0 2017-04-02 00:00:00,1099.169125

1 00:00,1

2 2017-04-04 00:00:00,1141.6003625

3 2017-04-05 00:00:00,1133.0793142857142

4 2017-04-06 00:00:00,1196.3079375

5 2017-04-07 00:00:00,1190.45425

6 2017-04-08 00:00:00,1181.1498375

7 00:00,1

8 2017-04-10 00:00:00,1207.744875

9 2017-04-11 00:00:00,1226.6170375

In [48]:
!head exam_review.csv

'head' is not recognized as an internal or external command,
operable program or batch file.

In [12]:
import csv

In [17]:
with open ('D:\Downloads/btc-market-price.csv', 'r') as fp:
    reader = csv.reader(fp)
    for index, (timestamp, price) in enumerate(reader):
        if index < 10:
            print(f"{timestamp}:${price}")

2017-04-02 00:00:00:$1099.169125
00:00:$1
2017-04-04 00:00:00:$1141.6003625
2017-04-05 00:00:00:$1133.0793142857142
2017-04-06 00:00:00:$1196.3079375
2017-04-07 00:00:00:$1190.45425
2017-04-08 00:00:00:$1181.1498375
00:00:$1
2017-04-10 00:00:00:$1207.744875
2017-04-11 00:00:00:$1226.6170375

In [47]:
with open ('exam_review.csv', 'r') as fp:
    reader = csv.reader(fp)
    for index, (timestamp, price) in enumerate(reader):
        if not values:
            continue
        fname, lname, age, math, french = values
        print(f"{fname}{lname}(age{age}) got {math} in Math and {french} in French")

ValueError: not enough values to unpack (expected 2, got 1)

## Reading data with Pandas

In [22]:
?pd.read_csv

In [23]:
csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"

pd.read_csv(csv_url).head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [26]:
df = pd.read_csv('D:\Downloads/btc-market-price.csv')
df.head()

   2017-04-02 00:00:00  1099.169125
0                00:00     1.000000
1  2017-04-04 00:00:00  1141.600363
2  2017-04-05 00:00:00  1133.079314
3  2017-04-06 00:00:00  1196.307937
4  2017-04-07 00:00:00  1190.454250

## First row behaviour with header parameter

In [29]:
df = pd.read_csv('D:\Downloads/btc-market-price.csv',
                 header=None)

In [30]:
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1                00:00     1.000000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

### Missing Value with na_values parameter

In [31]:
df = pd.read_csv('D:\Downloads/btc-market-price.csv',
                 header=None,
                na_values=['','?','-'])

In [32]:
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1                00:00     1.000000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

## Column names using names parameter

In [33]:
df = pd.read_csv('D:\Downloads/btc-market-price.csv',
                header=None,
                na_values=['','?','-'],
                names=['Timestamp','Price'])

In [34]:
df.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1                00:00     1.000000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    object
 1   Price      365 non-null    float64
dtypes: float64(1), object(1)
memory usage: 5.8+ KB

In [38]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

## Date Parser Using parse_dates parameter

In [41]:
df=pd.read_csv('D:\Downloads/btc-market-price.csv',
                header=None,
                na_values=['','?','-'],
                names=['Timestamp','Price'],
                dtype={'Price': float},
                parse_dates=[0])

In [42]:
df.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2023-03-09     1.000000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [43]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

## Custom data delimiters using sep parameter

In [49]:
exam_df = pd.read_csv('exam_review.csv',
                     sep='>')

In [50]:
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

## Custom numeric decimal and thousands character

In [61]:
exam_df =pd.read_csv('exam_review.csv',
                    sep='>')

In [62]:
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [63]:
exam_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

In [68]:
exam_df = pd.read_csv('exam_review.csv',
                    sep='>',
                    decimal=',')

In [69]:
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [70]:
exam_df[['math_score', 'french_score']].dtypes

math_score      float64
french_score    float64
dtype: object

In [76]:
pd.read_csv('exam_review.csv',
            sep='>',
            thousands=',')

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

In [77]:
pd.read_csv('exam_review.csv',
            sep='>',
            skiprows=2)

   Melvin   Scott  24      77  83
0  Amirah   Haley  22      92  67
1  Gerard   Mills  19  78,000  72
2     Amy  Grimes  23      91  81

In [78]:
exam_df = pd.read_csv('exam_review.csv',
                      sep='>',
                      decimal=',',
                      skiprows=[1,3])

In [79]:
exam_df

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

## Get rid of blank lines

In [80]:
pd.read_csv('exam_review.csv',
            sep='>',
            skip_blank_lines=False)

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

## Loading Specific Columns

In [84]:
pd.read_csv('exam_review.csv',
            usecols=['first_name', 'last_name', 'age'],
            sep='>')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

In [85]:
pd.read_csv('exam_review.csv',
            usecols=[0, 1, 2],
            sep='>')

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24
2     Amirah     Haley   22
3     Gerard     Mills   19
4        Amy    Grimes   23

## Using a Series instead of DataFrame

In [86]:
exam_test_1 = pd.read_csv('exam_review.csv',
                          sep='>',
                          usecols=['last_name'])

In [87]:
type(exam_test_1)

pandas.core.frame.DataFrame

In [88]:
exam_test_2 = pd.read_csv('exam_review.csv',
                          sep='>',
                          usecols=['last_name'],
                          squeeze=True)

C:\Users\beyza\AppData\Local\Temp\ipykernel_21424\2500062535.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  exam_test_2 = pd.read_csv('exam_review.csv',

In [89]:
type(exam_test_2)

pandas.core.series.Series

## Save to CSV file

In [90]:
exam_df

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

In [91]:
exam_df.to_csv('out.csv')

In [92]:
pd.read_csv('out.csv')

   Unnamed: 0 first_name last_name  age  math_score  french_score
0           0     Melvin     Scott   24        77.0            83
1           1     Gerard     Mills   19        78.0            72
2           2        Amy    Grimes   23        91.0            81

In [93]:
exam_df.to_csv('out.csv',
              index=None)

In [94]:
pd.read_csv('out.csv')

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81